<div style="background-color: #E74C3C; padding: 20px; text-align: center;">
    <div align="center"><span style="font-family:Monaco;font-size:50px;color:#FDFEFE">Master 2 MASERATI</span></div>
    <div align="center"><span style="font-family:Monaco;font-size:40px;color:#FDFEFE">Cours de Python</span></div>
    <div align="center"><span style="font-family:Monaco;font-size:30px;color:#FDFEFE">2023/2024</span></div>
    <div align="center"><span style="font-family:Monaco;font-size:15px;color:#FDFEFE">Enseignante : Lucia Cossaro</div>
    <div align="center"><span style="font-family:Monaco;font-size:15px;color:#FDFEFE">E-mail : luciacossaro@gmail.com</div>
    <hr>
</div>

<div style="background-color: #1C2833; padding: 20px; text-align: center;">
    <div align="center"><span style="font-family:Monaco;font-size:40px;color:#FDFEFE">Traitement de données</span></div>
    <hr>
</div>

# Initialisation

Chargeons d'abord les modules ainsi qu'un jeu de données

In [1]:
import pandas as pd
import numpy as np

In [2]:
df_gflight = pd.read_csv('../data/Googleflights.csv')

In [3]:
df_gflight.head()

                                                   id;respid;extrtime;origin;destination;company;depdate;arrdate;duration;flighttype;price;stopover;stopovertime
1;1;15/01/2016 10:12:21;CDG;NTE;Air France;2016...      0833333333333333;aller simple;52;Sans escale;
1;2;15/01/2016 10:12:21;CDG;NTE;Air France;2016...      0833333333333333;aller simple;52;Sans escale;
1;3;15/01/2016 10:12:21;CDG;NTE;Air France;2016...      0833333333333333;aller simple;52;Sans escale;
1;4;15/01/2016 10:12:21;ORY;NTE;Air France;2016...                    25;aller simple;69;Sans escale;
1;5;15/01/2016 10:12:21;CDG;NTE;Air France-HOP!...  0833333333333335;aller simple;93;1 escale;45mi...

In [4]:
df_gflight = pd.read_csv('../data/Googleflights.csv', sep=';', decimal=',')

Jettons un coup d'oeil à la table

In [5]:
df_gflight.sample(5)

,id,respid,extrtime,origin,destination,company,depdate,arrdate,duration,flighttype,price,stopover,stopovertime
2667,31,59,15/01/2016 10:15:21,TLS,UIP,Air France-Air France,2016-03-15T20:30:00,2016-03-16T21:50:00,25.333333,aller simple,87.0,1 escale,22h 25min à ORY
3671,45,1,15/01/2016 10:16:44,NTE,LYS,HOP!,2016-03-15T08:55:00,2016-03-15T10:05:00,1.166667,aller simple,50.0,Sans escale,NaN
5612,65,7,15/01/2016 10:18:44,LRT,SXB,Air France-Air France,2016-03-15T14:10:00,2016-03-15T18:10:00,4.000000,aller simple,117.0,1 escale,1h 20min à ORY
5150,58,157,15/01/2016 10:18:04,BES,TLS,Air France-Air France,2016-03-15T18:15:00,2016-03-16T17:05:00,22.833333,aller simple,98.0,1 escale,20h 15min à CDG
275,2,36,15/01/2016 10:12:27,LYS,NTE,HOP!-HOP!,2016-03-15T15:25:00,2016-03-16T14:20:00,22.916667,aller simple,94.0,1 escale,20h 30min à NCE

In [6]:
df_gflight.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6815 entries, 0 to 6814
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            6815 non-null   int64
 1   respid        6815 non-null   int64
 2   extrtime      6815 non-null   object
 3   origin        6815 non-null   object
 4   destination   6815 non-null   object
 5   company       6815 non-null   object
 6   depdate       6815 non-null   object
 7   arrdate       6815 non-null   object
 8   duration      6813 non-null   float64
 9   flighttype    6815 non-null   object
 10  price         6805 non-null   float64
 11  stopover      6815 non-null   object
 12  stopovertime  6672 non-null   object
dtypes: float64(2), int64(2), object(9)
memory usage: 692.3+ KB

# Chaines de caractères

## Modifier une série de manière systématique grâce à map

### Sur la base d'un dictionnaire

La méthode **Series.map()** permet, en utilisant un dictionnaire de "correspondance" de convertir des modalités en d'autres modalités

In [7]:
df_gflight['stopover'].unique()

array(['Sans escale', '1 escale'], dtype=object)

In [9]:
df_gflight['stopover'].nunique()

2

In [10]:
dict_escales = {
    'Sans escale' : 0,
    '1 escale' : 1,
}

In [11]:
df_gflight['stopover_num'] = df_gflight['stopover'].map(dict_escales)

In [12]:
df_gflight[['stopover', 'stopover_num']].sample(5)

      stopover  stopover_num
4817  1 escale             1
223   1 escale             1
4585  1 escale             1
5941  1 escale             1
3106  1 escale             1

### Sur la base d'une fonction

La méthode **Series.map()** permet aussi d'appliquer une fonction à chaque élément d'une Series

In [13]:
df_gflight['stopovertime'].unique()

array([nan, '45min à LYS', '1h 40min à LYS', ..., '21h 55min à MRS',
       '11h 50min à MRS', '23h 50min à NCE'], dtype=object)

On peut par exemple appliquer la fonction suivante pour transformer nos ids en chaines de caractères en index

In [14]:
def conv_func(val):
    if val is np.nan:
        return np.nan
    else:
        if 'h ' in val:
            heures = int(val.split('h ')[0]) #Decoupe selon 'h ' et après le convertir en entier.
            minutes = int(val.split('h ')[1].split('min')[0]) #Decoupe en plus selon 'Min' maintenant.
            return heures + minutes/60
        elif 'min' in val:
            return int(val.split('min')[0])/60
        else:
            raise BaseException('Problème')

In [15]:
df_gflight['stop_time'] = df_gflight['stopovertime'].map(conv_func)

In [16]:
df_gflight[['stopovertime', 'stop_time']].sample(5)

         stopovertime  stop_time
4396   7h 40min à ORY   7.666667
1930  15h 00min à ORY  15.000000
284   22h 20min à SXB  22.333333
1021  21h 25min à ORY  21.416667
1910   6h 50min à CDG   6.833333

On peut faire de même pour extraire les aéroports de correspondance. Ici, c'est une fonction lambda qui est utilisée :

In [17]:
def ma_fonc(x):
    if x is np.nan:
        return ''
    else:
        return x.split(' à ')[l]

In [18]:
df_gflight['stop_place'] = df_gflight['stopovertime'].map(lambda x: '' if x is np.nan else x.split(' à ')[1])

In [19]:
df_gflight[['stopovertime', 'stop_place']].sample(5)

         stopovertime stop_place
6753  25h 25min à CDG        CDG
5027  11h 50min à ORY        ORY
740   11h 55min à TLS        TLS
6203  11h 35min à MRS        MRS
1321  25h 05min à ORY        ORY

<div class="alert alert-block alert-info"><b>Pour aller plus loin :</b> <a href=https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.map.html> Doc officielle Pandas sur la <b>méthode map</b></a></div>

## Objet .str

Une autre manière aurait été de prendre les 3 derniers caractères de la chaine de caractères, pour faire des opérations de type méthode de **str** sur une Serie **object**, on peut utiliser l'objet **.str**

In [20]:
df_gflight['stopovertime'].str[-3:].sample(5)

1539    ORY
4296    ORY
111     LYS
2724    ORY
5424    CDG
Name: stopovertime, dtype: object

La plupart des méthodes aprises dans le cadre des chaines de caractères peuvent être utilisées avec l'objet **.str** :

In [21]:
df_gflight['stopovertime'].str.split().sample(5)

6789    [23h, 55min, à, MRS]
696      [5h, 10min, à, CDG]
6759    [11h, 10min, à, MRS]
1692    [20h, 30min, à, ORY]
841      [7h, 55min, à, CDG]
Name: stopovertime, dtype: object

In [22]:
df_gflight['stopovertime'].str.upper().sample(5)

6659    10H 30MIN À CDG
795      5H 25MIN À LYS
4238    16H 40MIN À ORY
5784     3H 25MIN À CDG
3471    16H 55MIN À TLS
Name: stopovertime, dtype: object

<div class="alert alert-block alert-info">
<b>Pour aller plus loin:</b> <a href=https://pandas.pydata.org/pandas-docs/stable/text.html> Tutoriel sur le <b>traitement de chaines de caractères </b></a>
</div>

# Valeurs manquantes

Remarque :

les **object** et **floatXX** contenir des **numpy.nan** (**valeur manquante** dans une **numpy.ndarray**, et par héritage **pandas.Series** et **pandas.DataFrame**), pas les **intXX**

## Savoir quelles cases sont nulles

In [23]:
df_gflight.isnull().head()

,id,respid,extrtime,origin,destination,company,depdate,arrdate,duration,flighttype,price,stopover,stopovertime,stopover_num,stop_time,stop_place
0,False,False,False,False,False,False,False,False,False,False,False,False,True,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False,True,False,True,False
2,False,False,False,False,False,False,False,False,False,False,False,False,True,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False,True,False,True,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

Ou l'inverse :

In [24]:
df_gflight.notnull().head()

,id,respid,extrtime,origin,destination,company,depdate,arrdate,duration,flighttype,price,stopover,stopovertime,stopover_num,stop_time,stop_place
0,True,True,True,True,True,True,True,True,True,True,True,True,False,True,False,True
1,True,True,True,True,True,True,True,True,True,True,True,True,False,True,False,True
2,True,True,True,True,True,True,True,True,True,True,True,True,False,True,False,True
3,True,True,True,True,True,True,True,True,True,True,True,True,False,True,False,True
4,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True

On peut les compter ainsi (car True est considéré = 1 et False = 0):

In [25]:
df_gflight.isnull().sum()

id                0
respid            0
extrtime          0
origin            0
destination       0
company           0
depdate           0
arrdate           0
duration          2
flighttype        0
price            10
stopover          0
stopovertime    143
stopover_num      0
stop_time       143
stop_place        0
dtype: int64

## Supprimer les lignes où il y a des valeurs manquantes

C'est typiquement ce qu'on voudra faire avec les valeurs manquantes sur notre variable expliquée

In [26]:
df_gflight = df_gflight.dropna(subset=['price'])

In [27]:
df_gflight.isnull().sum()

id                0
respid            0
extrtime          0
origin            0
destination       0
company           0
depdate           0
arrdate           0
duration          1
flighttype        0
price             0
stopover          0
stopovertime    133
stopover_num      0
stop_time       133
stop_place        0
dtype: int64

## Initialiser les valeurs manquantes d'une variable explicative à la valeur moyenne

In [28]:
df_gflight['duration'] = df_gflight['duration'].fillna(df_gflight['duration'].mean())

In [29]:
df_gflight.isnull().sum()

id                0
respid            0
extrtime          0
origin            0
destination       0
company           0
depdate           0
arrdate           0
duration          0
flighttype        0
price             0
stopover          0
stopovertime    133
stopover_num      0
stop_time       133
stop_place        0
dtype: int64

En pourcentage

In [30]:
df_gflight.isnull().sum() / len(df_gflight)

id              0.000000
respid          0.000000
extrtime        0.000000
origin          0.000000
destination     0.000000
company         0.000000
depdate         0.000000
arrdate         0.000000
duration        0.000000
flighttype      0.000000
price           0.000000
stopover        0.000000
stopovertime    0.019544
stopover_num    0.000000
stop_time       0.019544
stop_place      0.000000
dtype: float64

## Initialiser les valeurs manquantes d'une variable explicative à une modalité

In [31]:
df_gflight['stop_time'] = df_gflight['stop_time'].fillna(0)

In [32]:
df_gflight.isnull().sum()

id                0
respid            0
extrtime          0
origin            0
destination       0
company           0
depdate           0
arrdate           0
duration          0
flighttype        0
price             0
stopover          0
stopovertime    133
stopover_num      0
stop_time         0
stop_place        0
dtype: int64

<div class="alert alert-block alert-info">
<b>Pour aller plus loin:</b> <a href=https://pandas.pydata.org/pandas-docs/stable/missing_data.html> Tutoriel sur le <b>traitement des valeurs manquantes</b></a>
</div>

# Ajout/suppression de colonnes

## Ajouter une colonne

Ajoutons la Series représentant le temps en vol, qui est la différence entre la durée totale et le temps en correspondance :

In [33]:
df_gflight['inflight'] = df_gflight['duration'] - df_gflight['stop_time']

## Supprimer une colonne

Lorsqu'il y a des Series avec une seule modalité, elles sont généralement inutiles

In [34]:
df_gflight['flighttype'].unique()

array(['aller simple'], dtype=object)

Profitons-en pour supprimer quelques Series inutiles

In [35]:
df_gflight.columns

Index(['id', 'respid', 'extrtime', 'origin', 'destination', 'company',
       'depdate', 'arrdate', 'duration', 'flighttype', 'price', 'stopover',
       'stopovertime', 'stopover_num', 'stop_time', 'stop_place', 'inflight'],
      dtype='object')

In [36]:
df_gflight = df_gflight.drop(['flighttype', 'stopovertime', 'id', 'respid', 'extrtime'], axis=1)

**axis=1** car on veut supprimer des colonnes et que l'axe 0, ce sont les lignes

In [37]:
df_gflight.columns

Index(['origin', 'destination', 'company', 'depdate', 'arrdate', 'duration',
       'price', 'stopover', 'stopover_num', 'stop_time', 'stop_place',
       'inflight'],
      dtype='object')

# Séries temporelles

## Conversion en format date

Les variables temporelles en format texte sont aussi très difficiles à exploiter. On va **a minima** les transformer en objet **Timestamp** (l'objet de la librairie pandas permettant de donner une valeur temporelle précise)

In [38]:
for elem in ['depdate', 'arrdate']:
    df_gflight[elem] = pd.to_datetime(df_gflight[elem])

Normalement, to_datetime() fonctionne bien (surtout quand on lui demande de travailler sur un grand nombre de cas possibles, car il a alors moins de chance de se tromper en déterminant automatiquement un format de date/heure)

Mais on peut le forcer à adopter un format précis pour éviter toute erreur :

In [39]:
pd.to_datetime(df_gflight['depdate'], format='%Y-%m-%dT%H:%M:%S').head()

0   2016-03-15 12:35:00
1   2016-03-15 16:40:00
2   2016-03-15 21:05:00
3   2016-03-15 19:30:00
4   2016-03-15 13:20:00
Name: depdate, dtype: datetime64[ns]

## Conversion en float

Le format de séries temporelles que nous avons utilisé ne va pas nous convenir pour les régressions et les algotithmes de Data Science (il nous... On peut ajouter des colonnes calculant des timedelta, un nombre d'unité de temps (des jours par exemple, **D**) depuis une date de référence. Une bonne idée peut être de prendre la plus ancienne des dates des colonnes concernées...

In [40]:
df_gflight['depdate'].min()

Timestamp('2016-03-15 06:00:00')

In [41]:
df_gflight['depdate'].max()

Timestamp('2016-03-15 21:55:00')

In [42]:
df_gflight['time'] = (df_gflight['depdate'] - df_gflight['depdate'].min()) / np.timedelta64(1,'D')

<div class="alert alert-block alert-info"><b>Pour aller plus loin :</b> <a href=https://docs.scipy.org/doc/numpy/reference/arrays.datetime.html> Doc officielle Numpy sur les <b>objets datetime</b></a></div>

## Objet .dt

Comme pour les Series de chaines de caractères, pour lesquelles il existe un objet **.str**, pour les Series de dates, il existe un objet **.dt** qui permet de faire appel aux méthode des objets **datetime.datetime**

In [43]:
df_gflight['depdate'].dt.hour.sample(5)

3879    17
747     18
1159    13
1487     8
4945    17
Name: depdate, dtype: int32

In [44]:
df_gflight['depdate'].dt.dayofweek.sample(5)

993     1
6548    1
4994    1
611     1
1378    1
Name: depdate, dtype: int32

In [45]:
df_gflight['depdate'].dt.time.sample(5)

1762    16:15:00
4106    18:35:00
2546    09:10:00
5576    18:00:00
5879    06:35:00
Name: depdate, dtype: object

<div class="alert alert-block alert-info">
<b>Pour aller plus loin:</b> <a href=https://pandas.pydata.org/pandas-docs/stable/timeseries.html> Tutoriel sur le <b>traitement des séries temporelles</b></a>
</div>

# Catégories

## Object ou Category

Généralement, on essaie de faire en sorte d'avoir le moins de colonnes de type **object** (**str**) dans nos DataFrame, c'est le type que pandas assigne par défaut aux données qui ont l'air d'être des chaines de caractères.

Ce type pose deux problèmes:
- Il prend beaucoup de place en mémoire
- Il est le plus difficile à traiter dans le cadre de l'analyse

Et c'est rare qu'une colonne ait de bonnes raisons d'être de ce type (à part les trucs du genre colonne de commentaires). On va généralement convertir le plus de colonnes possible en types standardisés, plus faciles à exploiter ou retransformer

A l'inverse, dans les Data Science, on aime les nombres à virgule, les **float** qui sont utilisables par les algorithmes.

In [40]:
df_gflight.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6805 entries, 0 to 6814
Data columns (total 12 columns):
origin         6805 non-null object
destination    6805 non-null object
company        6805 non-null object
depdate        6805 non-null datetime64[ns]
arrdate        6805 non-null datetime64[ns]
duration       6805 non-null float64
price          6805 non-null float64
stopover       6805 non-null int64
stop_time      6805 non-null float64
stop_place     6805 non-null object
inflight       6805 non-null float64
time           6805 non-null float64
dtypes: datetime64[ns](2), float64(5), int64(1), object(4)
memory usage: 691.1+ KB

## Générer des catégories

On peut convertir les colonnes en utilisant la méthode **pandas.Series.astype('category')**

In [46]:
for elem in ['origin', 'destination', 'stopover', 'company', 'stop_place']:
    df_gflight[elem] = df_gflight[elem].astype('category')

In [47]:
df_gflight.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6805 entries, 0 to 6814
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   origin        6805 non-null   category
 1   destination   6805 non-null   category
 2   company       6805 non-null   category
 3   depdate       6805 non-null   datetime64[ns]
 4   arrdate       6805 non-null   datetime64[ns]
 5   duration      6805 non-null   float64
 6   price         6805 non-null   float64
 7   stopover      6805 non-null   category
 8   stopover_num  6805 non-null   int64
 9   stop_time     6805 non-null   float64
 10  stop_place    6805 non-null   category
 11  inflight      6805 non-null   float64
 12  time          6805 non-null   float64
dtypes: category(5), datetime64[ns](2), float64(5), int64(1)
memory usage: 514.6 KB

## Objet .cat

De même que les chaines de caractères ont **.str** et les dates ont **.dt**, les catégories ont **.cat**

In [48]:
df_gflight['origin'].sample(5)

1715    TLS
3088    MRS
5928    UIP
5642    LRT
4777    BES
Name: origin, dtype: category
Categories (18, object): ['BES', 'BOD', 'CDG', 'LAI', ..., 'SXB', 'TLN', 'TLS', 'UIP']

In [49]:
df_gflight['origin'].cat.codes.sample(5)

3676    11
2401    10
2769     2
1748    16
1611    16
dtype: int8

In [50]:
df_gflight['origin'].cat.categories

Index(['BES', 'BOD', 'CDG', 'LAI', 'LIL', 'LRT', 'LYS', 'MLH', 'MPL', 'MRS',
       'NCE', 'NTE', 'ORY', 'RNS', 'SXB', 'TLN', 'TLS', 'UIP'],
      dtype='object')

<div class="alert alert-block alert-info">
<b>Pour aller plus loin:</b> <a href=https://pandas.pydata.org/pandas-docs/stable/categorical.html> Tutoriel sur le <b>traitement des catégories</b></a>
</div>

# Ecriture dans un fichier

Stockons cette base de données modifiée, sous format Excel (pour visualiser facilement les données

In [54]:
df_gflight.to_excel('../data/output/Output_GFLT.xlsx')

Sous format **Pickle** (le format pure Python) juste pour pouvoir récupérer les données dans un autre notebook à **100% identique au DataFrame que nous avons ici**.

Les **catégories** en particulier sont un type qu'Excel ne sait pas gérer contrairement à Python... On perdrait donc cela en rechargeant depuis le fichier Excel)

In [53]:
df_gflight.to_pickle('../data/output/Output_GFLT.pickle')

# Jointures et concatenations

## Concaténation

On peut facilement ajouter des lignes à un DataFrame en utilisant la fonction **pandas.concat()**. 

Elle prend comme seul argument obligatoire un **tuple** ou une **list** de **DataFrame** (on peut en concatener plusieurs d'un coup)

### Axis = 1 (horizontale)

In [64]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})

df2 = pd.DataFrame({'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})

In [65]:
df1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [66]:
df2

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [67]:
df_concat_axis1 = pd.concat([df1, df2], axis=1)
df_concat_axis1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

### Axis = 0 (verticale)

In [68]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7']})

In [70]:
df1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [71]:
df2

    A   B
0  A4  B4
1  A5  B5
2  A6  B6
3  A7  B7

In [69]:
df_concat_axis0 = pd.concat([df1, df2], axis=0)
df_concat_axis0

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  A4  B4
1  A5  B5
2  A6  B6
3  A7  B7

<div class="alert alert-block alert-info"><b>Pour aller plus loin :</b> <a href=https://pandas.pydata.org/pandas-docs/stable/generated/pandas.concat.html> Doc officielle sur la méthode <b> .concat()</b></a></div>

## Jointure

In [4]:
df_noms = pd.DataFrame({'ID': [1, 2, 3, 4, 5],
                    'Nom': ['Alice', 'Bob', 'Charlie', 'David', 'Eva']})

df_ages = pd.DataFrame({'ID': [3, 4, 5, 6, 7],
                    'Age': [25, 30, 35, 40, 45]})

In [5]:
df_noms

   ID      Nom
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David
4   5      Eva

In [6]:
df_ages

   ID  Age
0   3   25
1   4   30
2   5   35
3   6   40
4   7   45

Left, inner, outer

In [7]:
df_infos = df_noms.merge(df_ages, on="ID", how="left", validate="1:1")
df_infos

   ID      Nom   Age
0   1    Alice   NaN
1   2      Bob   NaN
2   3  Charlie  25.0
3   4    David  30.0
4   5      Eva  35.0

In [8]:
df_infos = df_noms.merge(df_ages, on="ID", how="inner", validate="1:1")
df_infos

   ID      Nom  Age
0   3  Charlie   25
1   4    David   30
2   5      Eva   35

In [9]:
df_infos = df_noms.merge(df_ages, on="ID", how="outer", validate="1:1")
df_infos

   ID      Nom   Age
0   1    Alice   NaN
1   2      Bob   NaN
2   3  Charlie  25.0
3   4    David  30.0
4   5      Eva  35.0
5   6      NaN  40.0
6   7      NaN  45.0

In [10]:
df_achats = pd.DataFrame({'ID': [1, 2, 3, 4, 5, 3, 6, 7],
                         'Num_commande': [454535, 754757, 96786, 800766, 564564, 89685, 34252, 54646]})
df_achats

   ID  Num_commande
0   1        454535
1   2        754757
2   3         96786
3   4        800766
4   5        564564
5   3         89685
6   6         34252
7   7         54646

<div class="alert alert-block alert-danger">
Utiliser toujours "validate" pour avoir le résultat de merge attendu et éviter des erreurs, tels que l'introduction de doublons

In [11]:
df_infos_doublons = df_infos.merge(df_achats, on="ID", how="left")
df_infos_doublons

   ID      Nom   Age  Num_commande
0   1    Alice   NaN        454535
1   2      Bob   NaN        754757
2   3  Charlie  25.0         96786
3   3  Charlie  25.0         89685
4   4    David  30.0        800766
5   5      Eva  35.0        564564
6   6      NaN  40.0         34252
7   7      NaN  45.0         54646

In [12]:
df_infos = df_infos.merge(df_achats, on="ID", how="left", validate="1:1")

MergeError: Merge keys are not unique in right dataset; not a one-to-one merge

In [13]:
df_infos = df_infos.merge(df_achats, on="ID", how="left", validate="1:m")
df_infos

   ID      Nom   Age  Num_commande
0   1    Alice   NaN        454535
1   2      Bob   NaN        754757
2   3  Charlie  25.0         96786
3   3  Charlie  25.0         89685
4   4    David  30.0        800766
5   5      Eva  35.0        564564
6   6      NaN  40.0         34252
7   7      NaN  45.0         54646

In [14]:
df_ville = pd.DataFrame({'ID': [1, 2, 3, 4, 5, 6, 7],
                         'Ville': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami', "Boston", "Miami"]})
df_ville

   ID        Ville
0   1     New York
1   2  Los Angeles
2   3      Chicago
3   4      Houston
4   5        Miami
5   6       Boston
6   7        Miami

In [15]:
df_ville.set_index('ID', inplace=True)

In [16]:
df_infos = df_infos.merge(df_ville, left_on="ID", right_index=True, how="left", validate="m:1")
df_infos

   ID      Nom   Age  Num_commande        Ville
0   1    Alice   NaN        454535     New York
1   2      Bob   NaN        754757  Los Angeles
2   3  Charlie  25.0         96786      Chicago
3   3  Charlie  25.0         89685      Chicago
4   4    David  30.0        800766      Houston
5   5      Eva  35.0        564564        Miami
6   6      NaN  40.0         34252       Boston
7   7      NaN  45.0         54646        Miami

<div class="alert alert-block alert-info"><b>Pour aller plus loin :</b> <a href=https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html> Doc officielle sur la méthode <b>.merge()</b></a></div>

---

<div class="alert alert-block alert-info"><b>Pour aller plus loin :</b> <a href=https://pandas.pydata.org/pandas-docs/stable/merging.html>Tutoriel sur les <b> jointures et concatenations </b></a></div>